// Работа с переменными
let admin;
let userName = "Джон";
admin = userName;
alert(admin);

// Придумайте правильные имена
let yourNamePlanet = "Земля";
let currentNameUser = userName;

// Какие буквы (заглавные или строчные) использовать для имён констант?
const BIRTHDAY = '18.04.1982'; // Данная константа известна до выполнения, поэтому её можно использовать в верхнем регистре
const age = someCode(BIRTHDAY); // Значение данной константы будет постоянно вычисляться, т.е. с каждым годом она будет изменяться и в таком случае мы запишем её в нижнем регистре