// Постфиксная и префиксная формы
let a = 1, b = 1;

let c = ++a; // a = 2, c = 2
let d = b++; // b = 2, d = 1

// Результат присваивания
let a1 = 2;

let x = 1 + (a1 *= 2); // a1 = 4, x = 5

// Преобразование типов
/*
1. "" + 1 + 0 = 10
2. "" - 1 + 0 = -1
3. true + false = 1
4. 6 / "3" = 2
5. "2" * "3" = 6
6. 4 + 5 + "px" = 9px
7. "$" + 4 + 5 = $45
8. "4" - 2 = 2
9. "4px" - 2 = NaN
10. "  -9  " + 5 = -9 5
11. "  -9  " - 5 = -14
12. null + 1 = 1
13. undefined + 1 = NaN
14. " \t \n" - 2 = -2
*/


// Исправьте сложение
let a3 = prompt("Первое число?", 1);
let b3 = prompt("Второе число?", 2);

alert(+a3 + +b3); // 3